_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_2 (InputLayer)         (None, 256, 256, 3)       0         
_________________________________________________________________
lambda_3 (Lambda)            (None, 160, 160, 3)       0         
_________________________________________________________________
separable_conv2d_1 (Separabl (None, 160, 160, 64)      283       
_________________________________________________________________
batch_normalization_9 (Batch (None, 160, 160, 64)      256       
_________________________________________________________________
activation_10 (Activation)   (None, 160, 160, 64)      0         
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 80, 80, 64)        0         
_________________________________________________________________
separable_conv2d_2 (Separabl (None, 80, 80, 128)       8896      
_________________________________________________________________
batch_normalization_10 (Batc (None, 80, 80, 128)       512       
_________________________________________________________________
activation_11 (Activation)   (None, 80, 80, 128)       0         
_________________________________________________________________
max_pooling2d_5 (MaxPooling2 (None, 40, 40, 128)       0         
_________________________________________________________________
separable_conv2d_3 (Separabl (None, 40, 40, 256)       34176     
_________________________________________________________________
batch_normalization_11 (Batc (None, 40, 40, 256)       1024      
_________________________________________________________________
activation_12 (Activation)   (None, 40, 40, 256)       0         
_________________________________________________________________
separable_conv2d_4 (Separabl (None, 40, 40, 256)       68096     
_________________________________________________________________
batch_normalization_12 (Batc (None, 40, 40, 256)       1024      
_________________________________________________________________
activation_13 (Activation)   (None, 40, 40, 256)       0         
_________________________________________________________________
max_pooling2d_6 (MaxPooling2 (None, 20, 20, 256)       0         
_________________________________________________________________
up_sampling2d_4 (UpSampling2 (None, 40, 40, 256)       0         
_________________________________________________________________
separable_conv2d_5 (Separabl (None, 40, 40, 256)       68096     
_________________________________________________________________
batch_normalization_13 (Batc (None, 40, 40, 256)       1024      
_________________________________________________________________
activation_14 (Activation)   (None, 40, 40, 256)       0         
_________________________________________________________________
separable_conv2d_6 (Separabl (None, 40, 40, 128)       35200     
_________________________________________________________________
batch_normalization_14 (Batc (None, 40, 40, 128)       512       
_________________________________________________________________
activation_15 (Activation)   (None, 40, 40, 128)       0         
_________________________________________________________________
up_sampling2d_5 (UpSampling2 (None, 80, 80, 128)       0         
_________________________________________________________________
separable_conv2d_7 (Separabl (None, 80, 80, 64)        9408      
_________________________________________________________________
batch_normalization_15 (Batc (None, 80, 80, 64)        256       
_________________________________________________________________
activation_16 (Activation)   (None, 80, 80, 64)        0         
_________________________________________________________________
up_sampling2d_6 (UpSampling2 (None, 160, 160, 64)      0         
_________________________________________________________________
separable_conv2d_8 (Separabl (None, 160, 160, 3)       771       
_________________________________________________________________
batch_normalization_16 (Batc (None, 160, 160, 3)       12        
_________________________________________________________________
activation_17 (Activation)   (None, 160, 160, 3)       0         
_________________________________________________________________
lambda_4 (Lambda)            (None, 256, 256, 3)       0         
_________________________________________________________________
reshape_2 (Reshape)          (None, 65536, 3)          0         
_________________________________________________________________
activation_18 (Activation)   (None, 65536, 3)          0         
=================================================================
Total params: 229,546
Trainable params: 227,236
Non-trainable params: 2,310
_________________________________________________________________
