_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 256, 256, 3)       0         
_________________________________________________________________
lambda_1 (Lambda)            (None, 160, 160, 3)       0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 160, 160, 64)      1792      
_________________________________________________________________
batch_normalization_1 (Batch (None, 160, 160, 64)      256       
_________________________________________________________________
activation_1 (Activation)    (None, 160, 160, 64)      0         
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 80, 80, 64)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 80, 80, 128)       73856     
_________________________________________________________________
batch_normalization_2 (Batch (None, 80, 80, 128)       512       
_________________________________________________________________
activation_2 (Activation)    (None, 80, 80, 128)       0         
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 40, 40, 128)       0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 40, 40, 256)       295168    
_________________________________________________________________
batch_normalization_3 (Batch (None, 40, 40, 256)       1024      
_________________________________________________________________
activation_3 (Activation)    (None, 40, 40, 256)       0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 40, 40, 256)       590080    
_________________________________________________________________
batch_normalization_4 (Batch (None, 40, 40, 256)       1024      
_________________________________________________________________
activation_4 (Activation)    (None, 40, 40, 256)       0         
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 20, 20, 256)       0         
_________________________________________________________________
up_sampling2d_1 (UpSampling2 (None, 40, 40, 256)       0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 40, 40, 256)       590080    
_________________________________________________________________
batch_normalization_5 (Batch (None, 40, 40, 256)       1024      
_________________________________________________________________
activation_5 (Activation)    (None, 40, 40, 256)       0         
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 40, 40, 128)       295040    
_________________________________________________________________
batch_normalization_6 (Batch (None, 40, 40, 128)       512       
_________________________________________________________________
activation_6 (Activation)    (None, 40, 40, 128)       0         
_________________________________________________________________
up_sampling2d_2 (UpSampling2 (None, 80, 80, 128)       0         
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 80, 80, 64)        73792     
_________________________________________________________________
batch_normalization_7 (Batch (None, 80, 80, 64)        256       
_________________________________________________________________
activation_7 (Activation)    (None, 80, 80, 64)        0         
_________________________________________________________________
up_sampling2d_3 (UpSampling2 (None, 160, 160, 64)      0         
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 160, 160, 3)       1731      
_________________________________________________________________
batch_normalization_8 (Batch (None, 160, 160, 3)       12        
_________________________________________________________________
activation_8 (Activation)    (None, 160, 160, 3)       0         
_________________________________________________________________
lambda_2 (Lambda)            (None, 256, 256, 3)       0         
_________________________________________________________________
reshape_1 (Reshape)          (None, 65536, 3)          0         
_________________________________________________________________
activation_9 (Activation)    (None, 65536, 3)          0         
=================================================================
Total params: 1,926,159
Trainable params: 1,923,849
Non-trainable params: 2,310
_________________________________________________________________
